Table of Contents
 Class IdeaCombiInput
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaCombiInput : AbstractIdeaObject<IIdeaCombiInput>, IEquatable<AbstractIdeaObject<IIdeaCombiInput>>, IIdeaCombiInput, IIdeaLoading, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaCombiInput>
IdeaCombiInput
Implements
IEquatable<AbstractIdeaObject<IIdeaCombiInput>>
IIdeaCombiInput
IIdeaLoading
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaCombiInput>.Id
 AbstractIdeaObject<IIdeaCombiInput>.Name
 AbstractIdeaObject<IIdeaCombiInput>.Identifier
 AbstractIdeaObject<IIdeaCombiInput>.GetHashCode()
 AbstractIdeaObject<IIdeaCombiInput>.Equals(object)
 AbstractIdeaObject<IIdeaCombiInput>.Equals(AbstractIdeaObject<IIdeaCombiInput>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaCombiInput(Identifier<IIdeaCombiInput>)
public IdeaCombiInput(Identifier<IIdeaCombiInput> identifer)
Parameters
identifer Identifier<IIdeaCombiInput>
 IdeaCombiInput(int)
public IdeaCombiInput(int id)
Parameters
id int
 IdeaCombiInput(string)
public IdeaCombiInput(string id)
Parameters
id string
Properties
 CombiItems
public virtual List<IIdeaCombiItem> CombiItems { get; set; }
Property Value
List<IIdeaCombiItem>
 TypeCalculationCombi
Type of combination
public virtual TypeCalculationCombiEC TypeCalculationCombi { get; set; }
Property Value
TypeCalculationCombiEC
 TypeCombiEC
Type of EC combination
public virtual TypeOfCombiEC TypeCombiEC { get; set; }
Property Value
TypeOfCombiEC
 Edit this page